---
kind: type
id: T:Autodesk.Revit.DB.FillPatternElement
source: html/64ecefd0-f5c4-5cd9-53bd-10a64739257e.htm
---
# Autodesk.Revit.DB.FillPatternElement

An element that represents a fill pattern.

## Syntax (C#)
```csharp
public class FillPatternElement : Element
```

## Remarks
The FillPatternElement represents a fill pattern in a project.
 It enables the user to retrieve, modify or create a fill pattern in a project.